# brew files
cask_args appdir: '/Applications'

# taps, expanding functionality
# tap 'caskroom/cask' # don't think I need this
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'vitorgalvao/tiny-scripts'

# brews
brew 'autojump'
brew 'coreutils'
brew 'git'
brew 'hr'
brew 'hub'
brew 'jq'
brew 'libav' # for pulling audio out of videos
brew 'mas'
brew 'mongodb'
brew 'openssl'
brew 'redis'
brew 'shellcheck'
brew 'tvnamer'
brew 'wifi-password'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# programming languages
# brew 'go'
brew 'node'
# brew 'python3'

# casks
cask '1password'
cask 'a-better-finder-rename'
cask 'adapter'
cask 'alfred'
cask 'bartender'
cask 'dropbox'
# cask 'fluid'
cask 'flux'
cask 'font-inconsolata'
cask 'google-chrome'
cask 'google-drive'
cask 'hazel'
cask 'iterm2'
cask 'keepingyouawake'
cask 'keka'
cask 'musicbrainz-picard'
cask 'ngrok'
cask 'openemu'
cask 'postman'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'steam'
cask 'sublime-text3'
cask 'techstoreclub-simple-comic'
cask 'transmission'
cask 'visual-studio-code'

mas 'Airmail 3', id: 918858936
mas '2Do', id: 477670270
mas 'Pocket', id: 568494494
mas 'Tweetbot', id: 557168941
mas 'Wunderlist', id: 410628904
# mas 'Xcode', id: 497799835
