# brew files
cask_args appdir: '/Applications'

# taps, expanding functionality
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'vitorgalvao/tiny-scripts'

# brews
# some of these are dependencies of other things
brew 'autoconf'
brew 'autojump'
brew 'xz'
brew 'automake'
brew 'coreutils'
brew 'gdbm'
brew 'git'
brew 'go'
brew 'hr'
brew 'hub'
brew 'oniguruma'
brew 'jq'
brew 'libgpg-error'
brew 'pkg-config'
brew 'makedepend'
brew 'mas'
brew 'scons'
brew 'openssl'
brew 'mongodb'
brew 'node'
brew 'readline'
brew 'sqlite'
brew 'python3'
brew 'redis'
brew 'shellcheck'
brew 'tvnamer'
brew 'youtube-dl'
brew 'vitorgalvao/tiny-scripts/cask-repair'

brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting '

# casks
cask 'sublime-text3'
cask 'alfred'
cask 'flux'
cask 'keepingyouawake'
cask 'iterm2'
cask 'font-inconsolata'
cask 'keka'
cask 'dropbox'
cask 'google-drive'
cask 'google-chrome'
cask 'techstoreclub-simple-comic'
cask 'spotify'
cask 'slack'
cask 'transmission'
cask 'hazel'
cask 'ngrok'
cask 'spectacle'
cask 'postman'
cask 'adapter'

mas 'DeskConnect', id: 642220194
mas 'Markoff', id: 1084713122
# mas 'GarageBand', id: 682658836
# mas 'iMovie', id: 408981434
mas 'Xcode', id: 497799835
mas 'Pocket', id: 568494494
# mas 'Pages', id: 409201541
mas 'Slack', id: 803453959
mas 'Airmail 3', id: 918858936
mas 'Wunderlist', id: 410628904
mas 'Tweetbot', id: 557168941
